{
    "amalan": [
      {
        "title": "Bangun tidur untuk makan sahur dengan segera berdzikir, berwudhu, dan shalat. Dengan melakukan seperti ini akan lepas tiga ikatan setan ketika tidur.",
        "hadith": "عَقِدَ الشَّيْطَانُ عَلَى قَافِيَةِ رَأْسِ أَحَدِكُمْ إِذَا هُوَ نَامَ ثَلاَثَ عُقَدٍ ، يَضْرِبُ كُلَّ عُقْدَةٍ عَلَيْكَ لَيْلٌ طَوِيلٌ فَارْقُدْ ، فَإِنِ اسْتَيْقَظَ فَذَكَرَ اللَّهَ انْحَلَّتْ عُقْدَةٌ ، فَإِنْ تَوَضَّأَ انْحَلَّتْ عُقْدَةٌ ، فَإِنْ صَلَّى انْحَلَّتْ عُقْدَةٌ فَأَصْبَحَ نَشِيطًا طَيِّبَ النَّفْسِ ، وَإِلاَّ أَصْبَحَ خَبِيثَ النَّفْسِ كَسْلاَنَ",
        "hadith_tr": "“Setan membuat tiga ikatan di tengkuk (leher bagian belakang) salah seorang dari kalian ketika tidur. Di setiap ikatan setan akan mengatakan, “Malam masih panjang, tidurlah!” Jika ia bangun lalu berdzikir kepada Allah, lepaslah satu ikatan. Kemudian jika dia berwudhu, lepaslah lagi satu ikatan. Kemudian jika dia mengerjakan shalat, lepaslah ikatan terakhir. Di pagi hari dia akan bersemangat dan bergembira. Jika tidak melakukan seperti ini, dia tidak ceria dan menjadi malas.” (HR. Bukhari, no. 1142 dan Muslim, no. 776).",
        "time": "sahur"
      },
      {
        "title": "Melakukan shalat tahajud walaupun hanya dua atau empat rakaat. Lalu menutup dengan shalat witir jika belum melakukan shalat witir ketika shalat tarawih. Jika sudah menutup witir pada shalat tarawih, maka tidak mengulangi witir karena tidak boleh ada dua witir dalam satu malam.",
        "hadith": "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا : أَنَّ النَّبِيَّ – صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ – ، قَالَ : (( صَلاةُ اللَّيْلِ مَثْنَى مَثْنَى ، فَإذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ )) مُتَّفَقٌ عَلَيْهِ",
        "hadith_tr": "Dari Ibnu ‘Umar radhiyallahu ‘anhuma, Nabi shallallahu ‘alaihi wa sallam bersabda, “Shalat malam itu dua rakaat salam, dua rakaat salam. Maka apabila engkau takut masuk waktu Shubuh, hendaklah melakukan witir satu rakaat.” (Muttafaqun ‘alaih) [HR. Bukhari, no. 1137 dan Muslim, no. 749]",
        "time": "sahur"
      },
      {
        "title": "Setelah shalat, berdoa sesuai dengan hajat yang diinginkan karena sepertiga malam terakhir (waktu sahur) adalah waktu terkabulnya doa.",
        "hadith": "يَنْزِلُ رَبُّنَا تَبَارَكَ وَتَعَالَى كُلَّ لَيْلَةٍ إِلَى السَّمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الآخِرُ فَيَقُولُ مَنْ يَدْعُونِى فَأَسْتَجِيبَ لَهُ وَمَنْ يَسْأَلُنِى فَأُعْطِيَهُ وَمَنْ يَسْتَغْفِرُنِى فَأَغْفِرَ لَهُ",
        "hadith_tr": "”Rabb kita turun ke langit dunia pada setiap malam yaitu ketika sepertiga malam terakhir. Allah berfirman, ’Barangsiapa yang berdoa kepada-Ku, niscaya Aku kabulkan. Barangsiapa yang meminta kepada-Ku, niscaya Aku penuhi. Dan barangsiapa yang memohon ampun kepada-Ku, niscaya Aku ampuni.” (HR. Bukhari no. 1145 dan Muslim no. 1808)",
        "time": "sahur"
      },
      {
        "title": "Melakukan persiapan untuk makan sahur lalu menyantapnya. Ingatlah bahwa dalam makan sahur terdapat keberkahan.",
        "hadith": "تَسَحَّرُوا فَإِنَّ فِى السَّحُورِ بَرَكَةً",
        "hadith_tr": "“Makan sahurlah kalian karena dalam makan sahur terdapat keberkahan.” (Muttafaqun ‘alaih. HR. Bukhari, no. 1923 dan Muslim, no. 1095).",
        "time": "sahur"
      },
      {
        "title": "Sambil menunggu azan Shubuh, memperbanyak istighfar dan menyempatkan membaca Al-Quran.",
        "hadith": "وَالْمُسْتَغْفِرِينَ بِالْأَسْحَارِ",
        "hadith_tr": "“Dan orang-orang yang meminta ampun di waktu sahur.”(QS. Ali Imran: 17)",
        "time": "sahur"
      },
      {
        "title": "Waktu makan sahur berakhir ketika azan Shubuh berkumandang (masuknya fajar Shubuh).",
        "hadith": "وَكُلُواْ وَاشْرَبُواْ حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ مِنَ الْفَجْرِ",
        "hadith_tr": "“Dan makan minumlah hingga terang bagimu benang putih dari benang hitam, yaitu fajar. Kemudian sempurnakanlah puasa itu sampai (datang) malam.” (QS. Al-Baqarah: 187).",
        "time": "sahur"
      },
      {
        "title": "Bagi yang berada dalam keadaan junub, maka segera mandi wajib. Masih dibolehkan masuk waktu Shubuh dalam keadaan junub dan tetap berpuasa. Termasuk juga masih boleh masuk waktu Shubuh dalam keadaan belum mandi suci dari haidh.",
        "hadith": "قَدْ كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يُدْرِكُهُ الْفَجْرُ فِى رَمَضَانَ وَهُوَ جُنُبٌ مِنْ غَيْرِ حُلُمٍ فَيَغْتَسِلُ وَيَصُومُ",
        "hadith_tr": "“Rasulullah pernah menjumpai waktu fajar di bulan Ramadhan dalam keadaan junub bukan karena mimpi basah, kemudian beliau mandi dan tetap berpuasa.” (HR. Muslim, no. 1109).",
        "time": "sahur"
      },
      {
        "title": "Ketika mendengar azan Shubuh disunnahkan melakukan lima amalan berikut.",
        "hadith": "إِذَا سَمِعْتُمُ الْمُؤَذِّنَ فَقُولُوا مِثْلَ مَا يَقُولُ ثُمَّ صَلُّوا عَلَىَّ فَإِنَّهُ مَنْ صَلَّى عَلَىَّ صَلاَةً صَلَّى اللَّهُ عَلَيْهِ بِهَا عَشْرًا ثُمَّ سَلُوا اللَّهَ لِىَ الْوَسِيلَةَ فَإِنَّهَا مَنْزِلَةٌ فِى الْجَنَّةِ لاَ تَنْبَغِى إِلاَّ لِعَبْدٍ مِنْ عِبَادِ اللَّهِ وَأَرْجُو أَنْ أَكُونَ أَنَا هُوَ فَمَنْ سَأَلَ لِىَ الْوَسِيلَةَ حَلَّتْ لَهُ الشَّفَاعَةُ",
        "hadith_tr": "“Jika kalian mendengar muazin, maka ucapkanlah seperti apa yang diucapkan oleh muazin. Kemudian bershalawatlah untukku. Karena siapa yang bershalawat kepadaku sekali, maka Allah akan bershalawat padanya (memberi ampunan padanya) sebanyak sepuluh kali. Kemudian mintalah wasilah pada Allah untukku. Karena wasilah itu adalah tempat di surga yang hanya diperuntukkan bagi hamba Allah, aku berharap akulah yang mendapatkannya. Siapa yang meminta untukku wasilah seperti itu, dialah yang berhak mendapatkan syafaatku.” (HR. Muslim, no. 384).",
        "description": [
          "a. mengucapkan seperti apa yang diucapkan oleh muazin.",
          "b. bershalawat pada Nabi setelah mendengar azan: ALLOHUMMA SHOLLI ‘ALA MUHAMMAD atau membaca shalawat Ibrahimiyyah seperti yang dibaca saat tasyahud.",
          "c. minta kepada Allah untuk Rasulullah wasilah dan keutamaan sebagaimana yang disebutkan dalam hadits Jabir bin ‘Abdillah: ALLOHUMMAROBBA HADZIHID DA’WATIT TAAMMAH WASH SHOLATIL QOOIMAH, AATI MUHAMMADANIL WASILATA WAL FADHILAH, WAB’ATSHU MAQOOMAM MAHMUUDALLADZI WA ‘ADTAH.",
          "d. lalu membaca: ASYHADUALLA ILAHA ILLALLAH WAHDAHU LAA SYARIKA LAH WA ANNA MUHAMMADAN ‘ABDUHU WA RASULUH, RODHITU BILLAHI ROBBAA WA BI MUHAMMADIN ROSULAA WA BIL ISLAMI DIINAA, sebagaimana disebutkan dalam hadits Sa’ad bin Abi Waqqash.",
          "e. memanjatkan doa sesuai yang diinginkan. (Lihat Jalaa’ Al-Afham karya Ibnul Qayyim, hlm. 329-331)."
        ],
        "time": "subuh"
      },
      {
        "title": "Melaksanakan shalat sunnah Fajar (qabliyah Shubuh) sebanyak dua rakaat.",
        "hadith": "رَكْعَتَا الْفَجْرِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا",
        "hadith_tr": "“Dua rakaat shalat sunnah Fajar lebih baik daripada dunia dan seisinya.” (HR. Muslim, no. 725)",
        "time": "subuh"
      },
      {
        "title": "Shalat sunnah Fajar dijaga sebagaimana shalat sunnah rawatib lainnya.",
        "hadith": "مَنْ ثَابَرَ عَلَى ثِنْتَىْ عَشْرَةَ رَكْعَةً مِنَ السُّنَّةِ بَنَى اللَّهُ لَهُ بَيْتًا فِى الْجَنَّةِ أَرْبَعِ رَكَعَاتٍ قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ بَعْدَهَا وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ وَرَكْعَتَيْنِ قَبْلَ الْفَجْرِ",
        "hadith_tr": "“Barang siapa merutinkan shalat sunnah dua belas rakaat dalam sehari, maka Allah akan membangunkan baginya sebuah rumah di surga. Dua belas rakaat tersebut adalah empat rakaat sebelum Zhuhur, dua rakaat sesudah Zhuhur, dua rakaat sesudah Maghrib, dua rakaat sesudah ‘Isya, dan dua rakaat sebelum Shubuh.” (HR. Tirmidzi, no. 414. Al-Hafizh Abu Thahir mengatakan bahwa sanad hadits ini hasan).",
        "time": "subuh"
      },
      {
        "title": "Melaksanakan shalat Shubuh berjamaah di masjid bagi laki-laki dan berusaha mendapatkan takbir pertama bersama imam di masjid. Sedangkan shalat terbaik bagi wanita adalah di rumah, bahkan di dalam kamarnya.",
        "hadith_tr": "“Shalat jamaah lebih baik 27 derajat dibanding shalat sendirian.” (HR. Bukhari, no. 645 dan Muslim, no. 650).",
        "hadith": "صَلاَةُ الْجَمَاعَةِ أَفْضَلُ مِنْ صَلاَةِ الْفَذِّ بِسَبْعٍ وَعِشْرِينَ دَرَجَةً",
        "time": "subuh"
      },
      {
        "title": "Setelah melaksanakan shalat sunnah Fajar, menyibukkan diri dengan berdoa dan membaca Al-Quran.",
        "hadith": "إِنَّ الدُّعَاءَ لاَ يُرَدُّ بَيْنَ الأَذَانِ وَالإِقَامَةِ فَادْعُوا",
        "time": "subuh",
        "hadith_tr": "“Sesungguhnya doa yang tidak tertolak adalah doa antara adzan dan iqamah, maka berdoalah (kala itu).” (HR. Ahmad, 3:155. Syaikh Syu’aib Al-Arnauth mengatakan bahwa sanad hadits ini shahih)."
      },
      {
        "title": "Setelah shalat Shubuh berdiam di masjid untuk berdzikir seperti membaca dzikir pagi-petang, membaca Al-Quran dengan tujuan mengkhatamkannya dalam sebulan, atau mendengarkan majelis ilmu hingga matahari meninggi (kira-kira 15 menit setelah matahari terbit). Ketika matahari meninggi tadi, lalu melaksanakan shalat isyraq sebanyak dua rakaat yang dijanjikan pahalanya haji dan umrah yang sempurna.",
        "hadith": "وَعَنْ عُثْمَانَ بْنِ عَفَّانَ – رَضِيَ اللهُ عَنْهُ – قَالَ : قَالَ رَسُوْلُ اللهِ – صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ – : (( مَا مِنْ عَبْدٍ يَقُولُ فِي صَبَاحِ كُلِّ يَوْمٍ وَمَسَاءِ كُلِّ لَيْلَةٍ : بِسْمِ اللهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلاَ فِي السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيمُ ، ثَلاثَ مَرَّاتٍ ، إِلاَّ لَمْ يَضُرَّهُ شَيْءٌ )) . رَوَاهُ أَبُوْ دَاوُدَ وَالتِّرْمِذِيُّ ، وَقَالَ : (( حَدِيْثٌ حَسَنٌ صَحِيْحٌ ))",
        "time": "subuh",
        "hadith_tr": "Dari ‘Utsman bin ‘Affan h, ia berkata, Rasulullah bersabda, “Tidaklah seorang hamba mengucapkan setiap pagi dari setiap harinya dan setiap petang dari setiap malamnya kalimat: BISMILLAHILLADZI LAA YADHURRU MA’ASMIHI SYAI-UN FIL ARDHI WA LAA FIS SAMAA’ WA HUWAS SAMII’UL ‘ALIIM (dengan nama Allah Yang dengan namaNya tidak ada sesuatu pun yang membahayakan di bumi dan tidak juga di langit, dan Dialah Yang Maha Mendegar lagi 30 24 Jam di Bulan Ramadhan Maha Mengetahui) sebanyak tiga kali, maka tidak aka nada apa pun yang membahayakannya.” (HR. Abu Daud, no. 5088; Tirmidzi, no. 3388; Ibnu Majah, no. 3388. Al-Hafizh Abu Thahir mengatakan bahwa sanad hadits ini hasan)."
      },
      {
        "title": "Sejak terbit fajar Shubuh (fajar shadiq) tadi menjalankan rukun dan tidak melakukan pembatal-pembatal puasa.",
        "description": [
          "Rukun puasa ada dua:",
          "a. Berniat puasa, di mana niat puasa Ramadhan tersebut harus ada di malam hari sebelum terbit fajar, niat tersebut harus dikhususkan untuk puasa Ramadhan, dan niat harus diulang tiap malamnya.",
          "b. Menahan diri dari berbagai pembatal, mulai dari terbit fajar Shubuh hingga tenggelamnya matahari.",
          "Pembatal puasa ada enam:",
          "a. Makan dan minum atau memasukkan sesuatu yang berpengaruh pada lambung dan sifatnya mengenyangkan.",
          "b. Muntah dengan sengaja.",
          "c. Hubungan intim dengan sengaja",
          "d. Mengeluarkan mani dengan sengaja (al-istimnaa’).",
          "e. Datang bulan (haidh) dan nifas",
          "f. Gila dan murtad.",
          "(Lihat Al-Fiqh Al-Manhaji, 1:340-345)"
        ],
        "time": "pagi"
      },
      {
        "title": "Saat puasa, meninggalkan hal-hal yang diharamkan yaitu berdusta, ghibah (membicarakan jelek orang lain), namimah (adu domba), memandang wanita yang tidak halal, dan mendengarkan musik.",
        "hadith": "مَنْ لَمْ يَدَعْ قَوْلَ الزُّورِ وَالْعَمَلَ بِهِ فَلَيْسَ لِلَّهِ حَاجَةٌ فِى أَنْ يَدَعَ طَعَامَهُ وَشَرَابَهُ ",
        "time": "pagi",
        "hadith_tr": "“Barang siapa yang tidak meninggalkan perkataan dusta malah mengamalkannya, maka Allah tidak butuh dari rasa lapar dan haus yang dia tahan.” (HR. Bukhari, no. 1903)."
      },
      {
        "title": "Melakukan shalat sunnah Dhuha minimal dua rakaat, maksimalnya tidak dibatasi. Waktu shalat Dhuha dimulai dari setelah matahari meninggi (15 menit setelah matahari terbit) hingga mendekati waktu zawal (15 menit sebelum Zhuhur).",
        "description": [
          "Waktu Dhuha dapat dibagi menjadi tiga:",
          "a. Awal waktu yaitu setelah matahari terbit dan meninggi hingga setinggi tombak",
          "Syaikh Muhammad bin Shalih Al-‘Utsaimin r berkata, “Awal waktu shalat Dhuha adalah ketika matahari meninggi setinggi tombak ketika dilihat, yaitu (sekitar) 15 menit setelah matahari terbit.” (Syarh Al-Arba’in An-Nawawiyyah, hlm. 289).",
          "b. Akhir waktu yaitu dekat dengan waktu zawal saat matahari akan tergelincir ke barat.",
          "Syaikh Ibnu ‘Utsaimin r berkata, “Sekitar 10 atau 5 menit sebelum waktu zawal (matahari tergelincir ke barat).” (Syarh Al-Arba’in An-Nawawiyyah, hlm. 289).",
          "c. Waktu terbaik shalat Dhuha yaitu ketika matahari semakin tinggi dan semakin panas.",
          "Adapun doa setelah shalat Dhuha disebutkan dalam hadits dari Aisyah, ia berkata bahwa Rasulullah selesai shalat Dhuha, beliau mengucapkan,",
          "“ALLOHUMMAGHFIR-LII WA TUB ‘ALAYYA, INNAKA ANTAT TAWWABUR ROHIIM (artinya: Ya Allah, ampunilah aku dan terimalah taubatku, sesungguhnya Engkau Maha Penerima Taubat lagi Maha Penyayang) sampai beliau membacanya seratus kali.” (HR. Bukhari dalam Al-Adab Al-Mufrad, no. 619. Syaikh Al-Albani mengatakan bahwa hadits ini sanadnya shahih)."
        ],
        "time": "pagi"
      },
      {
        "title": "Tetap beraktivitas dan bekerja seperti biasa. Sebaik-baik pekerjaan adalah pekerjaan dengan tangan sendiri.",
        "hadith": "مَا أَكَلَ أَحَدٌ طَعَامًا قَطُّ خَيْرًا مِنْ أَنْ يَأْكُلَ مِنْ عَمَلِ يَدِهِ ، وَإِنَّ نَبِىَّ اللَّهِ دَاوُدَ – عَلَيْهِ السَّلاَمُ – كَانَ يَأْكُلُ مِنْ عَمَلِ يَدِهِ",
        "hadith_tr": "“Tidaklah seseorang memakan suatu makanan yang lebih baik dari makanan yang ia makan dari hasil kerja keras tangannya 40 24 Jam di Bulan Ramadhan sendiri. Karena Nabi Daud ‘alaihis salam dahulu bekerja pula dengan hasil kerja keras tangannya.” (HR. Bukhari, no. 2072).",
        "time": "pagi"
      },
      {
        "title": "Memperbanyak sedekah pada bulan Ramadhan karena keutamaannya sangat luar biasa dibanding dengan sedekah pada bulan lainnya.",
        "time": "pagi",
        "hadith": "كَانَ النَّبِىُّ – صلى الله عليه وسلم – أَجْوَدَ النَّاسِ ، وَأَجْوَدُ مَا يَكُونُ فِى رَمَضَانَ ، حِينَ يَلْقَاهُ جِبْرِيلُ ، وَكَانَ جِبْرِيلُ – عَلَيْهِ السَّلاَمُ – يَلْقَاهُ فِى كُلِّ لَيْلَةٍ مِنْ رَمَضَانَ ، فَيُدَارِسُهُ الْقُرْآنَ فَلَرَسُولُ اللَّهِ – صلى الله عليه وسلم – أَجْوَدُ بِالْخَيْرِ مِنَ الرِّيحِ الْمُرْسَلَةِ",
        "hadith_tr": "“Nabi adalah orang yang paling gemar bersedekah. Semangat beliau dalam bersedekah lebih membara lagi ketika bulan Ramadhan tatkala itu Jibril menemui beliau. Jibril menemui beliau setiap malamnya di bulan Ramadhan. Jibril mengajarkan Al-Quran kala itu. Dan Rasul adalah yang paling semangat dalam melakukan kebaikan bagai angin yang bertiup.” (HR. Bukhari, no. 3554 dan Muslim, no. 2307)."
      },
      {
        "title": "Memperbanyak membaca Al-Quran dengan memanfaatkan waktu senggang seperti saat berada dalam antrian panjang dan istirahat kerja.",
        "hadith": "« اقْرَإِ الْقُرْآنَ فِى شَهْرٍ » . قُلْتُ إِنِّى أَجِدُ قُوَّةً حَتَّى قَالَ « فَاقْرَأْهُ فِى سَبْعٍ وَلاَ تَزِدْ عَلَى ذَلِكَ »",
        "hadith_tr": "“Bacalah (khatamkanlah) Al-Quran dalam sebulan.” ‘Abdullah bin ‘Amr lalu berkata, “Aku mampu menambah lebih dari itu.” Beliau pun bersabda, “Bacalah (khatamkanlah) Al-Quran dalam tujuh hari, jangan lebih daripada itu.” (HR. Bukhari No. 5054).",
        "time": "pagi"
      },
      {
        "title": "Menjelang Zhuhur menyempatkan untuk tidur siang (qailulah) walau sesaat bagi yang mampu untuk melakukannya.",
        "hadith": "قِيْلُوْا فَإِنَّ الشَّيَاطِيْنَ لاَ تَقِيْلُ",
        "time": "pagi",
        "hadith_tr": "“Tidurlah qailulah (tidur siang) karena setan tidaklah mengambil tidur siang.” (HR. Abu Nu’aim dalam Ath-Thibb, 1:12; Akhbar Ashbahan, 1:195, 353; 2:69. Syaikh Al-Albani menyatakan bahwa sanad hadits ini hasan dalam Silsilah Al-Ahadits AshShahihah, no. 1647)."
      },
      {
        "title": "Ketika azan Zhuhur, melakukan lima amalan ketika mendengar azan sebagaimana yang telah disebutkan dalam poin kedelapan.",
        "time": "pagi"
      },
      {
        "title": "Melakukan shalat rawatib Zhuhur, empat rakaat qabliyah Zhuhur dan dua rakaat badiyah Zhuhur.",
        "description": [
          "Shalat rawatib Zhuhur dapat dikerjakan dengan 3 cara berikut.",
          "a. Shalat 4 rakaat sebelum dan 4 rakaat sesudahnya.",
          "b. Shalat 4 rakaat sebelum dan 2 rakaat sesudahnya.",
          "c. Shalat 2 rakaat sebelum dan 2 rakaat sesudahnya."
        ],
        "time": "pagi"
      },
      {
        "time": "pagi",
        "title": "Beristirahat bagi yang belum beristirahat sebelum Zhuhur atau menyiapkan makanan berbuka, suami bisa pula membantu dalam hal ini.",
        "hadith": "عَنِ الأَسْوَدِ قَالَ سَأَلْتُ عَائِشَةَ مَا كَانَ النَّبِىُّ – صلى الله عليه وسلم – يَصْنَعُ فِى أَهْلِهِ قَالَتْ كَانَ فِى مِهْنَةِ أَهْلِهِ ، فَإِذَا حَضَرَتِ الصَّلاَةُ قَامَ إِلَى الصَّلاَةِ",
        "hadith_tr": "Dari Al-Aswad, ia pernah bertanya pada ‘Aisyah, “Apa yang Nabi lakukan ketika berada di tengah keluarganya?” ‘Aisyah menjawab, “Rasulullah biasa membantu pekerjaan keluarganya di rumah. Jika telah tiba waktu shalat, beliau berdiri dan segera menuju shalat.” (HR. Bukhari, no. 6039)."
      },
      {
        "time": "ashar",
        "title": "Ketika masuk Ashar, menjawab kumandang azan dan melakukan amalan seperti pada poin kedelapan. Setelah itu, melaksanakan shalat sunnah qabliyah Ashar dua atau empat rakaat. Shalat ini tidak termasuk dalam shalat rawatib dua belas rakaat dalam sehari yang disebutkan sebelumnya.",
        "hadith_tr": "“Rasulullah biasa melakukan dua rakaat qabliyah ‘Ashar. ” (HR. An-Nasa’i, no. 581 dan Ahmad, 6:306. Syaikh Syu’aib Al-Arnauth menyatakan bahwa hadits ini shahih).",
        "hadith": "إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي رَكْعَتَيْنِ قَبْلَ الْعَصْرِ"
      },
      {
        "time": "ashar",
        "title": "Dilarang melakukan shalat sunnah setelah Shalat ‘Ashar karena ketika itu adalah waktu terlarang untuk shalat.",
        "hadith": "لَا صَلَاةَ بَعْدَ اَلصُّبْحِ حَتَّى تَطْلُعَ اَلشَّمْسُ وَلَا صَلَاةَ بَعْدَ اَلْعَصْرِ حَتَّى تَغِيبَ اَلشَّمْسُ",
        "hadith_tr": "“Tidak ada shalat setelah shalat Shubuh sampai matahari meninggi dan tidak ada shalat setelah shalat ‘Ashar sampai matahari tenggelam.” (HR. Bukhari, no. 586 dan Muslim, no. 827)."
      },
      {
        "time": "buka",
        "title": "Mempersiapkan makanan buka puasa untuk orang-orang yang akan berbuka di masjid-masjid terdekat atau bisa menjadi bagian dari panitia pengurusan buka puasa di masjid.",
        "hadith": "مَنْ فَطَّرَ صَائِمًا كَانَ لَهُ مِثْلُ أَجْرِهِ غَيْرَ أَنَّهُ لاَ يَنْقُصُ مِنْ أَجْرِ الصَّائِمِ شَيْئًا",
        "hadith_tr": "“Siapa memberi makan orang yang berpuasa, maka baginya pahala seperti orang yang berpuasa tersebut, tanpa mengurangi pahala orang yang berpuasa itu sedikit pun juga.” (HR. Tirmidzi, no. 807; Ibnu Majah, no. 1746; dan Ahmad, 5:192. Al-Hafizh Abu Thahir mengatakan bahwa hadits ini shahih)."
      },
      {
        "time": "buka",
        "title": "Bermajelis ilmu menjelang berbuka demi mengisi waktu luang.",
        "hadith": "وَمَا اجْتَمَعَ قَوْمٌ فِى بَيْتٍ مِنْ بُيُوتِ اللَّهِ يَتْلُونَ كِتَابَ اللَّهِ وَيَتَدَارَسُونَهُ بَيْنَهُمْ إِلاَّ نَزَلَتْ عَلَيْهِمُ السَّكِينَةُ وَغَشِيَتْهُمُ الرَّحْمَةُ وَحَفَّتْهُمُ الْمَلاَئِكَةُ وَذَكَرَهُمُ اللَّهُ فِيمَنْ عِنْدَهُ",
        "hadith_tr": "“Tidaklah suatu kaum berkumpul di salah satu rumah Allah membaca Kitabullah dan saling mengajarkan satu dan lainnya melainkan akan turun kepada mereka sakinah (ketenangan), akan dinaungi rahmat, akan dikelilingi para malaikat dan Allah akan menyebut-nyebut mereka di sisi makhluk yang dimuliakan di sisiNya.” (HR. Muslim, no. 2699)."
      },
      {
        "time": "buka",
        "title": "Sibukkan diri dengan doa ketika menunggu berbuka.",
        "hadith": "ثَلاَثَةٌ لاَ تُرَدُّ دَعْوَتُهُمُ الإِمَامُ الْعَادِلُ وَالصَّائِمُ حِينَ يُفْطِرُ وَدَعْوَةُ الْمَظْلُومِ",
        "hadith_tr": "“Ada tiga orang yang doanya tidak ditolak: (1) Pemimpin yang adil, (2) Orang yang berpuasa ketika dia berbuka, dan (3) Doa 58 24 Jam di Bulan Ramadhan orang yang terzalimi.” (HR. Tirmidzi, no. 2526, 3598; Ibnu Majah, no. 1752. Al-Hafizh Abu Thahir mengatakan bahwa hadits ini hasan)."
      },
      {
        "time": "buka",
        "title": "Memenuhi adab-adab berbuka dan adabadab makan saat berbuka.",
        "description": [
          "Pertama: Menyegerakan berbuka puasa.",
          "Kedua: Berbuka dengan ruthab, tamer, atau seteguk air.",
          "Ketiga: Sebelum makan berbuka, ucapkanlah ‘bismillah’ agar bertambah berkah.",
          "Keempat: Berdoa ketika berbuka “DZAHABAZH ZHOMA-U WABTALLATIL ‘URUUQU WA TSABATAL AJRU INSYA ALLAH (artinya: Rasa haus telah hilang dan urat-urat telah basah, dan pahala telah ditetapkan insya Allah)”",
          "Kelima: Mendoakan orang yang beri makan berbuka.",
          "Keenam: Ketika berbuka puasa di rumah orang lain mengucapkan doa “AFTHORO ‘INDAKUMUSH SHOO-IMUUNA WA AKALA THO’AMAKUMUL ABROOR WA SHOLLAT ‘ALAIKUMUL MALAA-IKAH (artinya: Orang-orang yang berpuasa berbuka di tempat kalian, orang-orang yang baik menyantap makanan kalian dan malaikat pun mendoakan agar kalian mendapat rahmat).” (HR. Abu Daud, no. 3854; Ibnu Majah, no. 1747; Ahmad, 3:118. Al-Hafizh Abu Thahir mengatakan bahwa hadits ini hasan)",
          "Ketujuh: Ketika menikmati susu saat berbuka berdoa ALLOHUMMA BAARIK LANAA FIIHI WA ATH’IMNAA KHOIRON MINHU” (Ya Allah, berkahilah kami padanya dan berilah kami makan yang lebih baik darinya)",
          "Kedelapan: Minum dengan tiga nafas dan membaca ‘bismillah’",
          "Kesembilan: Berdoa sesudah makan"
        ]
      },
      {
        "time": "maghrib",
        "title": "Jika masih mendengar suara azan Maghrib, maka menjawabnya seperti amalan pada poin kedelapan."
      },
      {
        "time": "maghrib",
        "title": "Menunaikan shalat Maghrib secara berjamaah di masjid bagi laki-laki, kemudian mengerjakan shalat sunnah rawatib badiyah Maghrib dua rakaat.",
        "hadith": "صَلَّيْتُ مَعَ رَسُولِ اللهِ – صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ – ، رَكْعَتَيْنِ قَبْلَ الظُّهْرِ، وَرَكْعَتْينِ بَعْدَهَا، وَرَكْعَتَيْنِ بَعْدَ الجُمُعَةِ ، وَرَكْعَتَينِ بَعدَ المَغْرِبِ ، وَرَكْعَتَينِ بَعدَ العِشَاءِ",
        "hadith_tr": "“Aku melaksanakan shalat bersama Rasulullah dua rakaat sebelum Zhuhur, dua rakaat setelahnya, dua rakaat setelah Jum’at, dua rakaat setelah Maghrib, dan dua rakaat setelah Isya.” (Muttafaqun ‘alaih. HR. Bukhari, no. 1172 dan Muslim, no. 729).",
        "description": [
          "Adakah shalat sunnah qabliyah Maghrib?",
          "“Kerjakanlah shalat sunnah sebelum Maghrib dua rakaat.” Kemudian beliau bersabda lagi, “Kerjakanlah shalat sunnah sebelum Maghrib dua rakaat bagi siapa yang mau.” Karena hal ini dikhawatirkan dijadikan sebagai sunnah.” (HR. Abu Daud, no. 1281. Syaikh Al-Albani mengatakan bahwa hadits ini shahih)."
        ]
      },
      {
        "time": "maghrib",
        "title": "Membaca dzikir petang karena waktunya adalah dari matahari tenggelam hingga pertengahan malam (menurut pendapat yang paling kuat).",
        "hadith": "أَما لَو قُلتَ حِينَ أمْسيت: أعُوذُ بِكَلماتِ اللَّهِ التَّامَّاتِ منْ شَرِّ مَا خَلَقَ لَمْ تَضُرَّك",
        "hadith_tr": "“Seandainya engkau mengucapkan ini saat sore hari, ‘AUDZU BI KALIMAATILLAHIT TAAMMAATI MIN SYARRI MAA KHOLAQ’ (Aku berlindung dengan kalimat-kalimat Allah yang sempurna dari kejahatan yang telah Dia ciptakan, pasti kalajengking itu tidak akan membahayakanmu.” (HR. Muslim, no. 2709)."
      },
      {
        "time": "maghrib",
        "title": "Makan hidangan berbuka puasa bersama keluarga dengan bersyukur kepada Allah atas segala nikmat-Nya, memuji makanan, dan tidak mencela makanan.",
        "hadith": "مَا عَابَ النَّبِىُّ – صلى الله عليه وسلم – طَعَامًا قَطُّ ، إِنِ اشْتَهَاهُ أَكَلَهُ ، وَإِنْ كَرِهَهُ تَرَكَهُ",
        "hadith_tr": "“Tidaklah Nabi mencela suatu makanan sedikit pun. Seandainya beliau menyukainya, beliau menyantapnya. Jika tidak menyukainya, beliau meninggalkannya (tidak memakannya).” (HR. Bukhari, no. 5409 dan Muslim, no. 2064)."
      },
      {
        "time": "isya",
        "title": "Mempersiapkan shalat Isya dan Tarawih dengan berwudhu, memakai wewangian (bagi pria), dan berjalan ke masjid.",
        "hadith": "إِنَّمَا حُبِّبَ إِلَـيَّ مِنْ دُنْيَاكُمْ: اَلنِّسَاءُ وَالطِّيْبُ، وَجُعِلَتْ قُرَّةُ عَيْنِـيْ فِـي الصَّلَاةِ",
        "hadith_tr": "“Sesungguhnya di antara kesenangan dunia kalian yang aku cintai adalah wanita dan wewangian. Dan dijadikan kesenangan hatiku terletak di dalam shalat.” (HR. An-Nasai, no. 3939. Syaikh Al-Albani mengatakan bahwa hadits ini shahih sebagaimana disebut dalam Shahih Al-Jami, no. 3124)."
      },
      {
        "time": "isya",
        "title": "Menjawab muazin dan melakukan amalan seperti poin kedelapan, melaksanakan shalat Isya berjamaah di masjid, dan melakukan shalat sunnah rawatib badiyah Isya dua rakaat."
      },
      {
        "time": "isya",
        "title": "Melaksanakan shalat tarawih berjamaah dengan sempurna di masjid, dan inilah salah satu keistimewaan Ramadhan.",
        "hadith": "مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
        "hadith_tr": "“Barang siapa melakukan qiyam Ramadhan karena iman dan mencari pahala, maka dosa-dosanya yang telah lalu akan diampuni.” (HR. Bukhari, no. 37 dan Muslim, no. 759).",
        "description": [
          "Yang dimaksud qiyam Ramadhan adalah shalat tarawih sebagaimana yang dituturkan oleh Imam Nawawi dalam Syarh Shahih Muslim, 6:39."
        ]
      },
      {
        "time": "isya",
        "title": "Tidak pergi hingga imam selesai agar dituliskan pahala shalat semalam suntuk.",
        "hadith": "إِنَّهُ مَنْ قَامَ مَعَ الإِمَامِ حَتَّى يَنْصَرِفَ كُتِبَ لَهُ قِيَامُ لَيْلَةً",
        "hadith_tr": "“Siapa yang shalat bersama imam sampai ia selesai, maka ditulis untuknya pahala qiyam satu malam penuh.” (HR. An-Nasai, no. 1605; Tirmidzi, no. 806; Ibnu Majah, no. 1327. Syaikh Al-Albani dalam Irwa’ Al-Ghalil, no. 447 mengatakan bahwa hadits ini shahih)."
      },
      {
        "time": "isya",
        "title": "Membaca doa setelah shalat Witir: “SUBHAANAL MALIKIL QUDDUUS” dibaca tiga kali, lalu dilanjutkan dengan “ROBBIL MALAAIKATI WAR RUUH” dibaca sekali; dan “ALLOHUMMA INNI A’UDZU BI RIDHOOKA MIN SAKHOTIK WA BI MU’AFAATIKA MIN ‘UQUBATIK, WA A’UDZU BIKA MINKA LAA UH-SHI TSANAA-AN ‘ALAIK, ANTA KAMAA ATSNAITA ‘ALA NAFSIK” dibaca sekali.",
        "description": [
          "“Jika Nabi mengucapkan salam, beliau mengucapkan, ‘SUBHAANAL MALIKIL QUDDUUS’ sebanyak tiga kali; ketika bacaan yang ketiga, beliau memanjangkan suaranya, lalu beliau mengucapkan, ‘ROBBIL MALAA-IKATI WAR RUUH.’” (HR. As-Sunan Al-Kubra Al-Baihaqi, 3:40 dan Sunan Ad-Daruquthni, 4:371. Tambahan “Robbil malaa-ikati war ruuh” adalah tambahan maqbulah yang diterima).",
          "“ALLOOHUMMA INNII A’UUDZU BI RIDHOOKA MIN SAKHOTIK WA BI MU’AAFAATIKA MIN ‘UQUUBATIK, WA A’UUDZU BIKA MINKA LAA UH-SHII TSANAAAN ‘ALAIK, ANTA KAMAA ATSNAITA ‘ALAA NAFSIK” (artinya: Ya Allah, aku berlindung dengan keridhaan-Mu dari kemarahan-Mu, dengan keselamatan-Mu dari hukuman-Mu, dan aku berlindung kepada-Mu dari siksa-Mu. Aku tidak mampu menghitung pujian dan sanjungan kepada-Mu, Engkau adalah sebagaimana yang Engkau sanjungkan untuk diri-Mu sendiri). (HR. Abu Daud, no. 1427; At-Tirmidzi, no. 3566; An-Nasa’i, no. 1748; dan Ibnu Majah, no. 1179. Al-Hafizh Abu Thahir mengatakan bahwa sanad hadits ini shahih)."
        ]
      },
      {
        "time": "tidur",
        "title": "Melakukan tadarus Al-Quran.",
        "hadith": "كَانَ النَّبِىُّ – صلى الله عليه وسلم – أَجْوَدَ النَّاسِ ، وَأَجْوَدُ مَا يَكُونُ فِى رَمَضَانَ ، حِينَ يَلْقَاهُ جِبْرِيلُ ، وَكَانَ جِبْرِيلُ – عَلَيْهِ السَّلاَمُ – يَلْقَاهُ فِى كُلِّ لَيْلَةٍ مِنْ رَمَضَانَ ، فَيُدَارِسُهُ الْقُرْآنَ فَلَرَسُولُ اللَّهِ – صلى الله عليه وسلم – أَجْوَدُ بِالْخَيْرِ مِنَ الرِّيحِ الْمُرْسَلَةِ",
        "hadith_tr": "“Nabi adalah orang yang paling gemar memberi. Semangat beliau dalam memberi lebih membara lagi ketika bulan Ramadhan tatkala itu Jibril menemui beliau. Jibril menemui beliau setiap malamnya di bulan Ramadhan. Jibril mengajarkan Al-Quran kala itu. Dan Rasul adalah yang paling semangat dalam melakukan kebaikan bagai angin yang b,ertiup.” (HR. Bukhari, no. 3554 dan Muslim, no. 2307)."
      },
      {
        "time": "tidur",
        "title": "Jika tidak ada keperluan mendesak pada malam hari, tidur lebih awal agar bisa bangun pada sepertiga malam terakhir. Tidak begadang kecuali jika ada kepentingan mendesak. Sebelum tidur memenuhi adab-adabnya seperti berwudhu, membaca doa sebelum tidur (BISMIKA ALLOOHUMMA AMUUTU WA AHYAA), membaca ayat kursi (sekali), dan membaca Al-Ikhlas, Al-Falaq, An-Naas lalu mengusap ke badan yang bisa dijangkau (diulang tiga kali).",
        "description": [
          "Larangan begadang disebutkan dalam hadits Abi Barzah, beliau berkata “Rasulullah membenci tidur sebelum shalat ‘Isya dan mengobrol setelahnya.” (HR. Bukhari, no. 568)."
        ]
      }
    ]
  }